## prepare
#### Iris Data

Use the function defined in acquire.py to load the iris data.

In [1]:
%matplotlib inline
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
import acquire
import env

In [3]:
df_i = acquire.get_iris_data()
df_i.head(3)

,species_id,species_name,measurement_id,petal_length,petal_width,sepal_length,sepal_width
0,1,setosa,1,1.4,0.2,5.1,3.5
1,1,setosa,2,1.4,0.2,4.9,3.0
2,1,setosa,3,1.3,0.2,4.7,3.2

In [4]:
df_i.shape

(150, 7)

In [5]:
df_i.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 7 columns):
species_id        150 non-null int64
species_name      150 non-null object
measurement_id    150 non-null int64
petal_length      150 non-null float64
petal_width       150 non-null float64
sepal_length      150 non-null float64
sepal_width       150 non-null float64
dtypes: float64(4), int64(2), object(1)
memory usage: 8.3+ KB

In [6]:
df_i.describe()

,species_id,measurement_id,petal_length,petal_width,sepal_length,sepal_width
count,150.000000,150.000000,150.000000,150.000000,150.000000,150.000000
mean,2.000000,75.500000,3.758000,1.199333,5.843333,3.057333
std,0.819232,43.445368,1.765298,0.762238,0.828066,0.435866
min,1.000000,1.000000,1.000000,0.100000,4.300000,2.000000
25%,1.000000,38.250000,1.600000,0.300000,5.100000,2.800000
50%,2.000000,75.500000,4.350000,1.300000,5.800000,3.000000
75%,3.000000,112.750000,5.100000,1.800000,6.400000,3.300000
max,3.000000,150.000000,6.900000,2.500000,7.900000,4.400000

In [7]:
df_i.species_name.value_counts()
#df.embarked.value_counts(dropna=False)

versicolor    50
setosa        50
virginica     50
Name: species_name, dtype: int64

In [8]:
df_i.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 7 columns):
species_id        150 non-null int64
species_name      150 non-null object
measurement_id    150 non-null int64
petal_length      150 non-null float64
petal_width       150 non-null float64
sepal_length      150 non-null float64
sepal_width       150 non-null float64
dtypes: float64(4), int64(2), object(1)
memory usage: 8.3+ KB

In [9]:
df_i.species_name.value_counts()

versicolor    50
setosa        50
virginica     50
Name: species_name, dtype: int64

In [10]:
df_i.species_name.value_counts().sum()

150

In [11]:
df_i.isnull().sum(axis = 0)

species_id        0
species_name      0
measurement_id    0
petal_length      0
petal_width       0
sepal_length      0
sepal_width       0
dtype: int64

In [12]:
df_i.species_name.value_counts(dropna=False)

versicolor    50
setosa        50
virginica     50
Name: species_name, dtype: int64

Drop the species_id and measurement_id columns.

In [13]:
df_i = df_i.drop(columns=(['measurement_id', 'species_id']))
df_i.head(3)

  species_name  petal_length  petal_width  sepal_length  sepal_width
0       setosa           1.4          0.2           5.1          3.5
1       setosa           1.4          0.2           4.9          3.0
2       setosa           1.3          0.2           4.7          3.2

Rename the species_name column to just species.

In [14]:
df_i.rename(columns={'species_name': 'species'}, inplace=True)
df_i.head()

  species  petal_length  petal_width  sepal_length  sepal_width
0  setosa           1.4          0.2           5.1          3.5
1  setosa           1.4          0.2           4.9          3.0
2  setosa           1.3          0.2           4.7          3.2
3  setosa           1.5          0.2           4.6          3.1
4  setosa           1.4          0.2           5.0          3.6

Encode the species name using a sklearn label encoder. Research the inverse_transform method of the label encoder. How might this be useful?

In [15]:
from sklearn.preprocessing import LabelEncoder

In [16]:
encoder_iris1 = LabelEncoder()
encoder_iris1.fit(df_i.species)
df_i.species = encoder_iris1.transform(df_i.species)

In [20]:
df_i.species.sample(10)

27     0
16     0
101    2
24     0
36     0
136    2
38     0
142    2
28     0
122    2
Name: species, dtype: int64

Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.

In [21]:
from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import MinMaxScaler
from sklearn.model_selection import train_test_split

def drop_columns(df):
    df.drop(columns=['measurement_id', 'species_id'], inplace=True)
    return df

def rename_columns(df):
    df.rename(columns={'species_name': 'species'}, inplace=True)
    return df

def encode_species(df):
    encoder_iris1 = LabelEncoder()
    encoder_iris1.fit(df.species)
    df.species = encoder_iris1.transform(df.species)
    return df

def prep_iris(df):
    df = drop_columns(df)
    df = rename_columns(df)
    df = encode_species(df)
    return df

df_i = acquire.get_iris_data()
df_i = prep_iris(df_i)
df_i.sample(10)

     species  petal_length  petal_width  sepal_length  sepal_width
85         1           4.5          1.6           6.0          3.4
35         0           1.2          0.2           5.0          3.2
143        2           5.9          2.3           6.8          3.2
147        2           5.2          2.0           6.5          3.0
115        2           5.3          2.3           6.4          3.2
64         1           3.6          1.3           5.6          2.9
106        2           4.5          1.7           4.9          2.5
101        2           5.1          1.9           5.8          2.7
3          0           1.5          0.2           4.6          3.1
12         0           1.4          0.1           4.8          3.0

#### Titanic Data

Use the function you defined in acquire.py to load the titanic data set.

In [22]:
%matplotlib inline
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import seaborn as sns

# ignore warnings
import warnings
warnings.filterwarnings("ignore")

from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import MinMaxScaler

In [23]:
import acquire
import env

In [24]:
df_t = acquire.get_titanic_data()
df_t.head(3)

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,None,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,None,Southampton,1

In [25]:
df_t.shape

(891, 13)

In [26]:
df_t.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
passenger_id    891 non-null int64
survived        891 non-null int64
pclass          891 non-null int64
sex             891 non-null object
age             714 non-null float64
sibsp           891 non-null int64
parch           891 non-null int64
fare            891 non-null float64
embarked        889 non-null object
class           891 non-null object
deck            203 non-null object
embark_town     889 non-null object
alone           891 non-null int64
dtypes: float64(2), int64(6), object(5)
memory usage: 90.6+ KB

In [27]:
df_t.describe()

,passenger_id,survived,pclass,age,sibsp,parch,fare,alone
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000,891.000000
mean,445.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208,0.602694
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429,0.489615
min,0.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000,0.000000
25%,222.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400,0.000000
50%,445.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200,1.000000
75%,667.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000,1.000000
max,890.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200,1.000000

In [28]:
df_t.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
passenger_id    891 non-null int64
survived        891 non-null int64
pclass          891 non-null int64
sex             891 non-null object
age             714 non-null float64
sibsp           891 non-null int64
parch           891 non-null int64
fare            891 non-null float64
embarked        889 non-null object
class           891 non-null object
deck            203 non-null object
embark_town     889 non-null object
alone           891 non-null int64
dtypes: float64(2), int64(6), object(5)
memory usage: 90.6+ KB

Handle the missing values in the embark_town and embarked columns.

In [32]:
df_t.embark_town.value_counts(dropna=False)

Southampton    644
Cherbourg      168
Queenstown      77
Other            2
Name: embark_town, dtype: int64

In [33]:
df_t.embark_town.fillna('Other', inplace=True)
#df.embark_town.fillna('Other', inplace=True)

In [34]:
df_t.embark_town.value_counts().sum() == df_t.shape[0]

True

In [35]:
df_t.embark_town.value_counts().sum()
#df_t.embark_town.value_counts().sum

891

In [36]:
df_t.shape

(891, 13)

In [37]:
df_t.isnull().sum(axis = 0)

passenger_id      0
survived          0
pclass            0
sex               0
age             177
sibsp             0
parch             0
fare              0
embarked          2
class             0
deck            688
embark_town       0
alone             0
dtype: int64

In [38]:
df_t.head(5)

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,None,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,None,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,None,Southampton,1

In [39]:
df_t.embarked.value_counts(dropna=False)

S      644
C      168
Q       77
NaN      2
Name: embarked, dtype: int64

In [40]:
df_t.embarked.fillna('O', inplace=True)

In [41]:
df_t.embarked.value_counts()

S    644
C    168
Q     77
O      2
Name: embarked, dtype: int64

In [42]:
df_t.embarked.value_counts().sum()

891

In [43]:
df_t.embarked.unique()

array(['S', 'C', 'Q', 'O'], dtype=object)

In [44]:
df_t.isnull().sum(axis = 0)

passenger_id      0
survived          0
pclass            0
sex               0
age             177
sibsp             0
parch             0
fare              0
embarked          0
class             0
deck            688
embark_town       0
alone             0
dtype: int64

Remove the deck column.

In [45]:
df_t.deck.describe()

count     203
unique      7
top         C
freq       59
Name: deck, dtype: object

In [46]:
df_t.deck.value_counts(dropna=False)

NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: deck, dtype: int64

In [47]:
df_t.deck.value_counts().sum()

203

In [48]:
df_t = df_t.drop(columns='deck')

In [49]:
df_t.shape

(891, 12)

In [50]:
df_t.isnull().sum(axis = 0)

passenger_id      0
survived          0
pclass            0
sex               0
age             177
sibsp             0
parch             0
fare              0
embarked          0
class             0
embark_town       0
alone             0
dtype: int64

In [51]:
df_t.age.fillna(df_t.age.median(), inplace=True)
# df_t.age.sample(10)

Use a label encoder to transform the embarked column.

In [52]:
from sklearn.preprocessing import LabelEncoder

In [53]:
encoder_t = LabelEncoder()
encoder_t.fit(df_t.embarked)
df_t.embarked = encoder_t.transform(df_t.embarked)

In [54]:
df_t.embarked.sample(10)

24     3
808    3
429    3
236    3
140    0
396    3
714    3
701    3
375    0
317    3
Name: embarked, dtype: int64

In [55]:
df_t.sample(3)

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alone
576,576,1,2,female,34.0,0,0,13.0000,3,Second,Southampton,1
548,548,0,3,male,33.0,1,1,20.5250,3,Third,Southampton,0
410,410,0,3,male,28.0,0,0,7.8958,3,Third,Southampton,1

In [56]:
df_t.describe()

,passenger_id,survived,pclass,age,sibsp,parch,fare,embarked,alone
count,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000
mean,445.000000,0.383838,2.308642,29.361582,0.523008,0.381594,32.204208,2.343434,0.602694
std,257.353842,0.486592,0.836071,13.019697,1.102743,0.806057,49.693429,1.167398,0.489615
min,0.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,222.500000,0.000000,2.000000,22.000000,0.000000,0.000000,7.910400,2.000000,0.000000
50%,445.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200,3.000000,1.000000
75%,667.500000,1.000000,3.000000,35.000000,1.000000,0.000000,31.000000,3.000000,1.000000
max,890.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200,3.000000,1.000000

don't standardize until after the training and test split.

we do train/test split in order to test how well the model generalizes, especially so we can use it for yet-unseen future data.

In [57]:
from sklearn.model_selection import train_test_split
train, test = train_test_split(df_t)

In [58]:
# fare_min = train.fare.min()
# fare_max = train.fare.max()
# fare_min
# fare_max

In [59]:
# fare_train = (train.fare - fare_min / fare_max - fare_min)
# fare_test =  (train.fare - fare_min / fare_max - fare_min)

min max standardization
out of sample error

In [60]:
from sklearn.preprocessing import MinMaxScaler
scaler_t = MinMaxScaler()
scaler_t.fit(train[['fare','age']])

MinMaxScaler(copy=True, feature_range=(0, 1))

In [61]:
train[['fare','age']] = scaler_t.transform(train[['fare','age']])
#test[['fare','age']] = scaler_t.transform(test[['fare','age']])

In [62]:
train[['fare','age']].head()

         fare       age
392  0.015469  0.346569
467  0.051822  0.698417
109  0.047138  0.346569
329  0.113168  0.195778
582  0.050749  0.673285

there are many more transformation tools in sklearn.preprocessing

In [71]:
# now group some of this work into reproducible functions:

from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import MinMaxScaler
from sklearn.model_selection import train_test_split

def handle_missing_values(df):
    df.embark_town.fillna('Other', inplace=True)
    df.embarked.fillna('O', inplace=True)
    df.age.fillna(df.age.median(), inplace=True)
    return df

def drop_columns(df):
    df.drop(columns='deck')
    return df

def encode_embarked(df):
    encoder_t = LabelEncoder()
    encoder_t.fit(df.embarked)
    df.embarked = encoder_t.transform(df.embarked)
    return df

# def split(df):
#     train, test = train_test_split(df)
#     return train, test

# def scale_min_max(df):
#     scaler_t = MinMaxScaler()
#     scaler_t.fit(df[['fare','age']])
#     df[['fare','age']] = scaler_t.transform(df[['fare','age']])
#     return df
    
def prep_titanic(df):
    df = handle_missing_values(df)
    df = drop_columns(df)
    df = encode_embarked(df)
#     df = split(df)
    return df
    

df_t = acquire.get_titanic_data()
df_t = prep_titanic(df_t)
df_t.sample(10)

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alone
633,633,0,1,male,0.346569,0,0,0.000000,3,First,Southampton,1
612,612,1,3,female,0.346569,1,0,0.030254,2,Third,Queenstown,0
727,727,1,3,female,0.346569,0,0,0.015103,2,Third,Queenstown,1
305,305,1,1,male,0.006283,1,2,0.295806,3,First,Southampton,0
588,588,0,3,male,0.271174,0,0,0.015713,3,Third,Southampton,1
268,268,1,1,female,0.723549,0,1,0.299539,3,First,Southampton,0
782,782,0,1,male,0.359135,0,0,0.058556,3,First,Southampton,1
845,845,0,3,male,0.522493,0,0,0.014737,3,Third,Southampton,1
807,807,0,3,female,0.220910,0,0,0.015176,3,Third,Southampton,1
104,104,0,3,male,0.459663,2,0,0.015469,3,Third,Southampton,0